app/views/authors/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ?  [["author_id", 2]]
---
<%(title(@author.name) %>

<h1><%= @author.name %></h1>
<p>Posts:</p>
<% @author.posts.each do |post| %>
  <div><%= post.title %> - <%= last_updated(post) %></div>
<% end %>